<a href="https://colab.research.google.com/github/averydonmoyer/ds1002-hdj3fw/blob/main/notebooks/21-dataframes-in-r-student.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data Frames in R

Build a data frame by hand.

In [1]:
album <- c("The Low End Theory", "Nevermind", "Port of Morrow",
           "Dark Side of the Moon", "Naked", "OK Computer",
           "Abbey Road", "Thriller", "Rumours", "The Joshua Tree")
year <- c(1991, 1991, 2012, 1973, 1988, 1997, 1969, 1982, 1977, 1987)
digital <- c(FALSE, FALSE, TRUE, FALSE, TRUE, TRUE, FALSE, FALSE, FALSE, TRUE)

df <- data.frame(Album = album, Year = year, Digital = digital)

In [2]:
# display the df

df

   Album                 Year Digital
1  The Low End Theory    1991 FALSE
2  Nevermind             1991 FALSE
3  Port of Morrow        2012  TRUE
4  Dark Side of the Moon 1973 FALSE
5  Naked                 1988  TRUE
6  OK Computer           1997  TRUE
7  Abbey Road            1969 FALSE
8  Thriller              1982 FALSE
9  Rumours               1977 FALSE
10 The Joshua Tree       1987  TRUE

#Column Naming

In [4]:
names(df) <- c("Album","Year","Digital")

## Insert a Column

In [3]:
df$Album

# pulling out individual columns as vectors

 [1] "The Low End Theory"    "Nevermind"             "Port of Morrow"
 [4] "Dark Side of the Moon" "Naked"                 "OK Computer"
 [7] "Abbey Road"            "Thriller"              "Rumours"
[10] "The Joshua Tree"

In [5]:
df$Artist <- c("A Tribe Called Quest", "Nirvana", "The Shins","Pink Floyd","Talking Heads","Radiohead","The Beatles","Michael Jackson","Fleetwood Mac","U2")

In [6]:
df

   Album                 Year Digital Artist
1  The Low End Theory    1991 FALSE   A Tribe Called Quest
2  Nevermind             1991 FALSE   Nirvana
3  Port of Morrow        2012  TRUE   The Shins
4  Dark Side of the Moon 1973 FALSE   Pink Floyd
5  Naked                 1988  TRUE   Talking Heads
6  OK Computer           1997  TRUE   Radiohead
7  Abbey Road            1969 FALSE   The Beatles
8  Thriller              1982 FALSE   Michael Jackson
9  Rumours               1977 FALSE   Fleetwood Mac
10 The Joshua Tree       1987  TRUE   U2

## Get the Structure

In [7]:
str(df)

'data.frame':	10 obs. of  4 variables:
 $ Album  : chr  "The Low End Theory" "Nevermind" "Port of Morrow" "Dark Side of the Moon" ...
 $ Year   : num  1991 1991 2012 1973 1988 ...
 $ Digital: logi  FALSE FALSE TRUE FALSE TRUE TRUE ...
 $ Artist : chr  "A Tribe Called Quest" "Nirvana" "The Shins" "Pink Floyd" ...

## Slicing & Filtering

Remember that a data frame is simply a 2-dimensional array. Rows + Columns.

The `[ ]` selector has two halves, separated by a comma: `[ <ROWS> , <COLUMNS> ]`

In [8]:
df[ROWS, COLUMNS]]

ERROR: ignored

In [9]:
df[ ,1:2]

   Album                 Year
1  The Low End Theory    1991
2  Nevermind             1991
3  Port of Morrow        2012
4  Dark Side of the Moon 1973
5  Naked                 1988
6  OK Computer           1997
7  Abbey Road            1969
8  Thriller              1982
9  Rumours               1977
10 The Joshua Tree       1987

In [10]:
df[1:5, ]

  Album                 Year Digital Artist
1 The Low End Theory    1991 FALSE   A Tribe Called Quest
2 Nevermind             1991 FALSE   Nirvana
3 Port of Morrow        2012  TRUE   The Shins
4 Dark Side of the Moon 1973 FALSE   Pink Floyd
5 Naked                 1988  TRUE   Talking Heads

In [14]:
# concatonate columns one and four

df[ ,c(1,4)]

   Album                 Artist
1  The Low End Theory    A Tribe Called Quest
2  Nevermind             Nirvana
3  Port of Morrow        The Shins
4  Dark Side of the Moon Pink Floyd
5  Naked                 Talking Heads
6  OK Computer           Radiohead
7  Abbey Road            The Beatles
8  Thriller              Michael Jackson
9  Rumours               Fleetwood Mac
10 The Joshua Tree       U2

In [12]:
# pull out only the word radio head

df[6,4]

[1] "Radiohead"

In [15]:
df

   Album                 Year Digital Artist
1  The Low End Theory    1991 FALSE   A Tribe Called Quest
2  Nevermind             1991 FALSE   Nirvana
3  Port of Morrow        2012  TRUE   The Shins
4  Dark Side of the Moon 1973 FALSE   Pink Floyd
5  Naked                 1988  TRUE   Talking Heads
6  OK Computer           1997  TRUE   Radiohead
7  Abbey Road            1969 FALSE   The Beatles
8  Thriller              1982 FALSE   Michael Jackson
9  Rumours               1977 FALSE   Fleetwood Mac
10 The Joshua Tree       1987  TRUE   U2

In [16]:
# want artists to appear first, followed by year, in the full dataframe

# can arbitraily select what we want using concatonateion in values of slicind brackets
#   (but a little clunky and manual)

df[c(1,9,4,5),c(4,2)]

  Artist               Year
1 A Tribe Called Quest 1991
9 Fleetwood Mac        1977
4 Pink Floyd           1973
5 Talking Heads        1988

In [17]:
# do the same as above, but without indexes

df [ , c("Album","Artist")]

   Album                 Artist
1  The Low End Theory    A Tribe Called Quest
2  Nevermind             Nirvana
3  Port of Morrow        The Shins
4  Dark Side of the Moon Pink Floyd
5  Naked                 Talking Heads
6  OK Computer           Radiohead
7  Abbey Road            The Beatles
8  Thriller              Michael Jackson
9  Rumours               Fleetwood Mac
10 The Joshua Tree       U2

In [18]:
# search only for the values where the digital is false
    # use a logical conditional

df[df$Digital == FALSE, ]

  Album                 Year Digital Artist
1 The Low End Theory    1991 FALSE   A Tribe Called Quest
2 Nevermind             1991 FALSE   Nirvana
4 Dark Side of the Moon 1973 FALSE   Pink Floyd
7 Abbey Road            1969 FALSE   The Beatles
8 Thriller              1982 FALSE   Michael Jackson
9 Rumours               1977 FALSE   Fleetwood Mac

In [19]:
# AND

df[df$Year > 1990 & df$Digital == TRUE, ]

  Album          Year Digital Artist
3 Port of Morrow 2012 TRUE    The Shins
6 OK Computer    1997 TRUE    Radiohead

In [22]:
# OR

df[df$Year > 1990 | df$Digital == TRUE, ]

   Album              Year Digital Artist
1  The Low End Theory 1991 FALSE   A Tribe Called Quest
2  Nevermind          1991 FALSE   Nirvana
3  Port of Morrow     2012  TRUE   The Shins
5  Naked              1988  TRUE   Talking Heads
6  OK Computer        1997  TRUE   Radiohead
10 The Joshua Tree    1987  TRUE   U2

## `tidyverse`

In [23]:
# Installing packages

install.packages("tidyverse")
library(tidyverse)

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

── Attaching core tidyverse packages ──────────────────────── tidyverse 2.0.0 ──
✔ dplyr     1.1.3     ✔ readr     2.1.4
✔ forcats   1.0.0     ✔ stringr   1.5.0
✔ ggplot2   3.4.4     ✔ tibble    3.2.1
✔ lubridate 1.9.3     ✔ tidyr     1.3.0
✔ purrr     1.0.2
── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()
ℹ Use the conflicted package (<http://conflicted.r-lib.org/>) to force all conflicts to become errors

In [ ]:
# Loading a library

In [25]:
# Piping

df %>%
  select(Album, Year) %>%
  filter(Year > 1990)

  Album              Year
1 The Low End Theory 1991
2 Nevermind          1991
3 Port of Morrow     2012
4 OK Computer        1997

# Import a CSV Manually

In [27]:
# Loading a CSV file into a data frame

titanic <- read.csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [28]:
titanic %>%
  select(Pclass, Name, Sex, Fare, Age) %>%
  filter(Sex == "female") %>%
  filter(Pclass == 3) %>%
  filter(Age < 20) %>%
  arrange(Name)

   Pclass Name                                            Sex    Fare    Age
1  3      Aks, Mrs. Sam (Leah Rosen)                      female  9.3500 18.00
2  3      Andersen-Jensen, Miss. Carla Christine Nielsine female  7.8542 19.00
3  3      Andersson, Miss. Ebba Iris Alfrida              female 31.2750  6.00
4  3      Andersson, Miss. Ellis Anna Maria               female 31.2750  2.00
5  3      Andersson, Miss. Erna Alexandra                 female  7.9250 17.00
6  3      Andersson, Miss. Ingeborg Constanzia            female 31.2750  9.00
7  3      Andersson, Miss. Sigrid Elisabeth               female 31.2750 11.00
8  3      Arnold-Franchi, Mrs. Josef (Josefine Franchi)   female 17.8000 18.00
9  3      Asplund, Miss. Lillian Gertrud                  female 31.3875  5.00
10 3      Attalah, Miss. Malake                           female 14.4583 17.00
11 3      Ayoub, Miss. Banoura                            female  7.2292 13.00
12 3      Baclini, Miss. Eugenie                          female 19.2583  0.75
13 3      Baclini, Miss. Helene Barbara                   female 19.2583  0.75
14 3      Baclini, Miss. Marie Catherine                  female 19.2583  5.00
15 3      Barbara, Miss. Saiide                           female 14.4542 18.00
16 3      Boulos, Miss. Nourelain                         female 15.2458  9.00
17 3      Carr, Miss. Helen "Ellen"                       female  7.7500 16.00
18 3      Devaney, Miss. Margaret Delia                   female  7.8792 19.00
19 3      Emanuel, Miss. Virginia Ethel                   female 12.4750  5.00
20 3      Ford, Miss. Robina Maggie "Ruby"                female 34.3750  9.00
21 3      Gilnagh, Miss. Katherine "Katie"                female  7.7333 16.00
22 3      Goodwin, Miss. Lillian Amy                      female 46.9000 16.00
23 3      Hegarty, Miss. Hanora "Nora"                    female  6.7500 18.00
24 3      Hirvonen, Miss. Hildur E                        female 12.2875  2.00
25 3      Johnson, Miss. Eleanor Ileen                    female 11.1333  1.00
26 3      Karun, Miss. Manca                              female 13.4167  4.00
27 3      Kink-Heilmann, Miss. Luise Gretchen             female 22.0250  4.00
28 3      McGowan, Miss. Anna "Annie"                     female  8.0292 15.00
29 3      Najib, Miss. Adele Kiamie "Jane"                female  7.2250 15.00
30 3      Nakid, Miss. Maria ("Mary")                     female 15.7417  1.00
31 3      Nicola-Yarred, Miss. Jamila                     female 11.2417 14.00
32 3      Palsson, Miss. Stina Viola                      female 21.0750  3.00
33 3      Palsson, Miss. Torborg Danira                   female 21.0750  8.00
34 3      Pettersson, Miss. Ellen Natalia                 female  7.7750 18.00
35 3      Sandstrom, Miss. Marguerite Rut                 female 16.7000  4.00
36 3      Sjoblom, Miss. Anna Sofia                       female  7.4958 18.00
37 3      Skoog, Miss. Mabel                              female 27.9000  9.00
38 3      Skoog, Miss. Margit Elizabeth                   female 27.9000  2.00
39 3      Strom, Miss. Telma Matilda                      female 10.4625  2.00
40 3      Turja, Miss. Anna Sofia                         female  9.8417 18.00
41 3      Van Impe, Miss. Catharina                       female 24.1500 10.00
42 3      Vander Planke, Miss. Augusta Maria              female 18.0000 18.00
43 3      Vestrom, Miss. Hulda Amanda Adolfina            female  7.8542 14.00
44 3      Yasbeck, Mrs. Antoni (Selini Alexander)         female 14.4542 15.00
45 3      Zabour, Miss. Hileni                            female 14.4542 14.50

#  Built-In Data

In [30]:
# you can call them by name
  # example: just call InsectSprays or starwars and the data will be there